'''В файле создайте переменную my_name.
Присвойте переменной значение — ваше имя. Помните, что строковые значения указываются в кавычках.
Напишите команду вывода значения переменной на экран. Используйте функцию print.'''

my_name = "Alena"
print(my_name)
