'''Создайте функцию, которая принимает на вход параметр num и печатает этот параметр в консоль.
Вызовите эту функцию 11 раз так, чтобы в консоль вывелся номер 88005553535.'''

def print_phone(num):
    print(num, end = '')

print_phone(8)
print_phone(8)
print_phone(0)
print_phone(0)
print_phone(5)
print_phone(5)
print_phone(5)
print_phone(3)
print_phone(5)
print_phone(3)
print_phone(5)