'''Объявите функцию print_greeting().
Тело функции: печать на экран выражения «Привет, мир!».
Напишите код, который вызывает функцию print_greeting().
Объявление функции (def) должно быть в коде до ее вызова.'''

def print_greeting():
    print("Привет, мир!")

print_greeting()