'''В файле создайте переменную my_age и присвойте ей значение — ваш возраст.
В следующей строке присвойте этой же переменной другое значение — ваш возраст через три года.
Напишите команду вывода значения переменной на экран. Используйте функцию print. '''

my_age = 37
my_age = 37 + 3
print(my_age)