'''Создайте переменную first_name.
Создайте переменную last_name.
Задайте значение обеих переменных через функцию input.
Выведите на экран текст в формате «Вас зовут: last_name first_name».'''

first_name = input("Введите ваше имя_")
last_name = input("Введите вашу фамилию_")
print("Вас зовут:" + last_name + " " + first_name)