# Создайте список [ 18, 14, 10, 6, 2 ] с помощью функции range()
# и выведите его на экран.

my_list = list(range(18, 0, -4)) #от какого числа, где закончить построение последовательности, какой шаг-сколько прибавить
print(my_list)